In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("dataframe").getOrCreate()

22/01/19 04:27:16 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

In [2]:
df = spark.read.csv("test2.csv", header=True, inferSchema=True)
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [3]:
df.columns

['Name', 'age', 'experience', 'Salary']

In [4]:
df.dtypes

[('Name', 'string'), ('age', 'int'), ('experience', 'int'), ('Salary', 'int')]

In [6]:
df.describe().show()

+-------+-----+------------------+------------------+------------------+
|summary| Name|               age|        experience|            Salary|
+-------+-----+------------------+------------------+------------------+
|  count|    5|                 7|                 5|                 7|
|   mean| null|43.142857142857146|               6.4|59057.142857142855|
| stddev| null| 21.17725644355733|2.3021728866442674|65188.620099494285|
|    min|danny|                23|                 4|              3400|
|    max|  kim|                87|                10|            200000|
+-------+-----+------------------+------------------+------------------+

In [7]:
df = df.withColumn("age two", df["age"]+2)
df.show()

+-------+----+----------+------+-------+
|   Name| age|experience|Salary|age two|
+-------+----+----------+------+-------+
|  danny|  30|        10| 30000|     32|
|hyunjoo|  33|      null| 40000|     35|
| eileen|  23|         5| 70000|     25|
| hailey|  44|         4|  3400|     46|
|   null|null|      null| 40000|   null|
|    kim|  36|         6|200000|     38|
|   null|  87|         7| 30000|     89|
|   null|  49|      null|  null|     51|
+-------+----+----------+------+-------+

In [8]:
df = df.withColumnRenamed("age two", "age 2")
df.show()

+-------+----+----------+------+-----+
|   Name| age|experience|Salary|age 2|
+-------+----+----------+------+-----+
|  danny|  30|        10| 30000|   32|
|hyunjoo|  33|      null| 40000|   35|
| eileen|  23|         5| 70000|   25|
| hailey|  44|         4|  3400|   46|
|   null|null|      null| 40000| null|
|    kim|  36|         6|200000|   38|
|   null|  87|         7| 30000|   89|
|   null|  49|      null|  null|   51|
+-------+----+----------+------+-----+

In [9]:
df.head(5)

[Row(Name='danny', age=30, experience=10, Salary=30000, age 2=32),
 Row(Name='hyunjoo', age=33, experience=None, Salary=40000, age 2=35),
 Row(Name='eileen', age=23, experience=5, Salary=70000, age 2=25),
 Row(Name='hailey', age=44, experience=4, Salary=3400, age 2=46),
 Row(Name=None, age=None, experience=None, Salary=40000, age 2=None)]

In [10]:
[print("{} is my name".format(c["Name"])) for c in df.head(5)]

danny is my name
hyunjoo is my name
eileen is my name
hailey is my name
None is my name

[None, None, None, None, None]

In [11]:
df = df.drop("age 2")
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [12]:
df.na.fill("missing").show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|missing|null|      null| 40000|
|    kim|  36|         6|200000|
|missing|  87|         7| 30000|
|missing|  49|      null|  null|
+-------+----+----------+------+

In [14]:
df.na.fill(1000).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      1000| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|1000|      1000| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      1000|  1000|
+-------+----+----------+------+

In [15]:
df.na.fill(1000,["age"]).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|1000|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [16]:
df.na.drop(how="any").show()

+------+---+----------+------+
|  Name|age|experience|Salary|
+------+---+----------+------+
| danny| 30|        10| 30000|
|eileen| 23|         5| 70000|
|hailey| 44|         4|  3400|
|   kim| 36|         6|200000|
+------+---+----------+------+

In [18]:
df.na.drop(how="any", subset=["age"]).show()

+-------+---+----------+------+
|   Name|age|experience|Salary|
+-------+---+----------+------+
|  danny| 30|        10| 30000|
|hyunjoo| 33|      null| 40000|
| eileen| 23|         5| 70000|
| hailey| 44|         4|  3400|
|    kim| 36|         6|200000|
|   null| 87|         7| 30000|
|   null| 49|      null|  null|
+-------+---+----------+------+

In [19]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [21]:
df.filter("age > 40").select(["age", "Salary"]).show()

+---+------+
|age|Salary|
+---+------+
| 44|  3400|
| 87| 30000|
| 49|  null|
+---+------+

In [24]:
df.filter((df["age"]>40) &
         (df["Salary"] >5000)).show()

+----+---+----------+------+
|Name|age|experience|Salary|
+----+---+----------+------+
|null| 87|         7| 30000|
+----+---+----------+------+

In [25]:
df.filter(~(df["age"]>40) &
         (df["Salary"] >5000)).show()

+-------+---+----------+------+
|   Name|age|experience|Salary|
+-------+---+----------+------+
|  danny| 30|        10| 30000|
|hyunjoo| 33|      null| 40000|
| eileen| 23|         5| 70000|
|    kim| 36|         6|200000|
+-------+---+----------+------+

In [28]:
df.filter((df["age"]>40) &
         ~(df["Salary"] >5000)).show()

+------+---+----------+------+
|  Name|age|experience|Salary|
+------+---+----------+------+
|hailey| 44|         4|  3400|
+------+---+----------+------+

In [29]:
df = spark.read.csv("test3.csv", header = True, inferSchema = True)
df.show()

+-------+----------+------+
|   Name|Department|Salary|
+-------+----------+------+
|  danny|  big data| 30000|
|hyunjoo|     admin| 40000|
| eileen|  big data| 70000|
| hailey|        it|  3400|
|   john|        it| 40000|
|    kim|  big data|200000|
|  nadal|        it| 30000|
+-------+----------+------+

In [30]:
spark

In [31]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)

### Groupby

In [33]:
df.groupBy("Name").sum()

DataFrame[Name: string, sum(Salary): bigint]

In [34]:
df.groupBy("Name").sum().show()

+-------+-----------+
|   Name|sum(Salary)|
+-------+-----------+
|  nadal|      30000|
|hyunjoo|      40000|
|    kim|     200000|
|   john|      40000|
|  danny|      30000|
| eileen|      70000|
| hailey|       3400|
+-------+-----------+

In [35]:
df.groupBy("Department").max().show()

+----------+-----------+
|Department|max(Salary)|
+----------+-----------+
|  big data|     200000|
|        it|      40000|
|     admin|      40000|
+----------+-----------+

In [36]:
df.groupBy("Department").sum().show()

+----------+-----------+
|Department|sum(Salary)|
+----------+-----------+
|  big data|     300000|
|        it|      73400|
|     admin|      40000|
+----------+-----------+

In [37]:
df.groupBy("Department").mean().show()

+----------+------------------+
|Department|       avg(Salary)|
+----------+------------------+
|  big data|          100000.0|
|        it|24466.666666666668|
|     admin|           40000.0|
+----------+------------------+

In [38]:
df.groupBy("Department").count().show()

+----------+-----+
|Department|count|
+----------+-----+
|  big data|    3|
|        it|    3|
|     admin|    1|
+----------+-----+

In [39]:
df.agg({"Salary":"sum"})

DataFrame[sum(Salary): bigint]

In [40]:
df.agg({"Salary":"sum"}).show()

+-----------+
|sum(Salary)|
+-----------+
|     413400|
+-----------+

In [43]:
df.agg({"Department":"sum"}).show()  # string

+---------------+
|sum(Department)|
+---------------+
|           null|
+---------------+